{
  "backend/main.mo": "Empty Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file.",
  "frontend/DEPLOYED_URL.md": "Template file for recording the latest Internet Computer deployment URL, canister ID, and verification status.",
  "frontend/DEPLOYMENT.md": "Detailed checklist for deploying to a new IC canister and verifying routing, deep links, and content.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color tokens, themes, and base styles.",
  "frontend/index.html": "Base HTML entry file that restores deep link URLs before React mounts and loads the main app script.",
  "frontend/public/404.html": "SPA fallback page that captures the original URL and redirects to root for client-side routing.",
  "frontend/src/App.tsx": "Sets up TanStack Router with landing and celebration routes wrapped in a ThemeProvider.",
  "frontend/src/components/celebration/CelebrationVisuals.tsx": "Renders animated balloons, stars, and hearts with reduced-motion handling for the celebration page.",
  "frontend/src/components/celebration/ConfettiCrackerBurst.tsx": "Shows a timed confetti burst animation with reduced-motion fallback.",
  "frontend/src/components/celebration/usePrefersReducedMotion.ts": "Hook that reads the user's reduced‑motion preference via matchMedia.",
  "frontend/src/components/CopyLinkButton.tsx": "Button that copies the current page URL to the clipboard and shows toast notifications.",
  "frontend/src/components/GeneratedArt.tsx": "Simple image component plus constants referencing generated asset paths.",
  "frontend/src/components/landing/LandingTemplateSelector.tsx": "Template selector UI using tabs to switch between landing variants.",
  "frontend/src/components/landing/templates/TemplateVariantA.tsx": "Elegant birthday landing layout with floating accents and a navigation button.",
  "frontend/src/components/landing/templates/TemplateVariantB.tsx": "Playful animated birthday landing with hearts, stars, and a celebrate button.",
  "frontend/src/components/landing/templates/TemplateVariantC.tsx": "Modern split‑layout birthday template with gift icon and navigation button.",
  "frontend/src/content/birthdayMessage.ts": "Exports a long personalized birthday message string.",
  "frontend/src/content/routes.ts": "Defines shared route constants for landing and celebration pages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity with react‑query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity login, state, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed.",
  "frontend/src/index.css": "Tailwind setup with custom celebratory color variables and animation utilities.",
  "frontend/src/main.tsx": "App entrypoint that mounts React with query and identity providers.",
  "frontend/src/pages/CelebrationPage.tsx": "Renders the birthday celebration page with visuals, message content, navigation back to landing, and a copy-link button.",
  "frontend/src/pages/LandingPage.tsx": "Displays a template selector and renders one of three landing page templates, with a copy-link button.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors, typography, container settings, and plugins for the frontend.",
  "project_state.json": "Defines the project’s state, existing features, and metadata for deployment and routing verification tasks."
}